In [1]:
# Pandas ===> It is an open source library that is used to hanndle data manipulation.

# Data Structures of Pandas
# (1). Series ===> It is 1-dimensional array. It contains only values not column name.
# (2). DataFrame ===> It is multi-dimensional array. It contains values with column name.

In [2]:
# !pip install pandas

In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\saurabh\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\saurabh\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\saurabh\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\saurabh\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\saurabh\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\saurabh\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [4]:
import pandas as pd

In [6]:
a = pd.Series([1,45,56,88])
a

0     1
1    45
2    56
3    88
dtype: int64

In [7]:
type(a)

pandas.core.series.Series

# DataFrame

In [8]:
a = {
    "Emp_ID" : [1,2,3,4,5,6,7,8],
    "Name" : ['sam', 'raj', 'nidhi', 'aniket', 'pallavi', 'garvit', 'suman', 'saurabh'],
    "Department" : ['IT', 'SALES', 'IT', 'HR', 'MANAGEMENT', 'OPERATIONS', 'SALES', 'IT'],
    "Working_Hours" : [8,9,9,8,9,8,9,9,]
}

In [9]:
type(a)

dict

In [10]:
df = pd.DataFrame(a)

In [11]:
df

   Emp_ID     Name  Department  Working_Hours
0       1      sam          IT              8
1       2      raj       SALES              9
2       3    nidhi          IT              9
3       4   aniket          HR              8
4       5  pallavi  MANAGEMENT              9
5       6   garvit  OPERATIONS              8
6       7    suman       SALES              9
7       8  saurabh          IT              9

# How can we import or export our dataframe?

In [14]:
df.to_csv("C:\\Users\\Saurabh\\OneDrive\\Desktop\\NUMPY-PANDAS.csv" , index=False)

In [17]:
df1 = pd.read_csv("C:\\Users\\Saurabh\\OneDrive\\Desktop\\NUMPY-PANDAS.csv")

In [18]:
df1

   Emp_ID     Name  Department  Working_Hours
0       1      sam          IT              8
1       2      raj       SALES              9
2       3    nidhi          IT              9
3       4   aniket          HR              8
4       5  pallavi  MANAGEMENT              9
5       6   garvit  OPERATIONS              8
6       7    suman       SALES              9
7       8  saurabh          IT              9

In [21]:
df2 = pd.read_csv("C:\\Users\\Saurabh\\OneDrive\\Desktop\\Databases\\num-panda dataset\\titanic.csv")

In [22]:
df2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

# How to check top 5 data?

In [24]:
df.head()

   Emp_ID     Name  Department  Working_Hours
0       1      sam          IT              8
1       2      raj       SALES              9
2       3    nidhi          IT              9
3       4   aniket          HR              8
4       5  pallavi  MANAGEMENT              9

In [25]:
df.head(2)

   Emp_ID Name Department  Working_Hours
0       1  sam         IT              8
1       2  raj      SALES              9

# How to check bottom data?

In [26]:
df.tail()

   Emp_ID     Name  Department  Working_Hours
3       4   aniket          HR              8
4       5  pallavi  MANAGEMENT              9
5       6   garvit  OPERATIONS              8
6       7    suman       SALES              9
7       8  saurabh          IT              9

In [27]:
df.tail(2)

   Emp_ID     Name Department  Working_Hours
6       7    suman      SALES              9
7       8  saurabh         IT              9

# How to check random indexed data?

In [30]:
df.sample(4)

   Emp_ID     Name  Department  Working_Hours
0       1      sam          IT              8
4       5  pallavi  MANAGEMENT              9
3       4   aniket          HR              8
7       8  saurabh          IT              9

# How can we check total shape of data?

In [32]:
df.shape

(8, 4)

# How can we chack the size of the data?

In [33]:
df.size

32

# How can we check total columns in a dataframe?

In [34]:
df.columns

Index(['Emp_ID', 'Name', 'Department', 'Working_Hours'], dtype='object')

# Case-1

# You have to update the 'aniket' to 'yamini' and 'raj' to 'rajat' and change the working hours also.

In [35]:
df['Name']

0        sam
1        raj
2      nidhi
3     aniket
4    pallavi
5     garvit
6      suman
7    saurabh
Name: Name, dtype: object

In [36]:
df['Name'][3]='yamini'
df['Name'][1]='rajat'

C:\Users\Saurabh\AppData\Local\Temp\ipykernel_30152\1115073753.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][3]='yamini'
C:\Users\Saurabh\AppData\Local\Temp\ipykernel_30152\1115073753.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][1]='rajat'

In [37]:
df

   Emp_ID     Name  Department  Working_Hours
0       1      sam          IT              8
1       2    rajat       SALES              9
2       3    nidhi          IT              9
3       4   yamini          HR              8
4       5  pallavi  MANAGEMENT              9
5       6   garvit  OPERATIONS              8
6       7    suman       SALES              9
7       8  saurabh          IT              9

In [38]:
df['Working_Hours'][1]=10

C:\Users\Saurabh\AppData\Local\Temp\ipykernel_30152\1002057398.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Working_Hours'][1]=10
C:\Users\Saurabh\AppData\Local\Temp\ipykernel_30152\1002057398.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Working_Hours'][1]=10

In [39]:
df

   Emp_ID     Name  Department  Working_Hours
0       1      sam          IT              8
1       2    rajat       SALES             10
2       3    nidhi          IT              9
3       4   yamini          HR              8
4       5  pallavi  MANAGEMENT              9
5       6   garvit  OPERATIONS              8
6       7    suman       SALES              9
7       8  saurabh          IT              9

# How can we check total sub_categories frequency of a column?

In [40]:
df['Name'].value_counts()

Name
sam        1
rajat      1
nidhi      1
yamini     1
pallavi    1
garvit     1
suman      1
saurabh    1
Name: count, dtype: int64

In [41]:
df['Department'].value_counts()

Department
IT            3
SALES         2
HR            1
MANAGEMENT    1
OPERATIONS    1
Name: count, dtype: int64

# How can we handle missing data?

In [44]:
df.isnull().sum()

Emp_ID           0
Name             0
Department       0
Working_Hours    0
dtype: int64

In [45]:
df

   Emp_ID     Name  Department  Working_Hours
0       1      sam          IT              8
1       2    rajat       SALES             10
2       3    nidhi          IT              9
3       4   yamini          HR              8
4       5  pallavi  MANAGEMENT              9
5       6   garvit  OPERATIONS              8
6       7    suman       SALES              9
7       8  saurabh          IT              9

In [46]:
df['Name'][2] = None
df['Department'][4] = None
df['Department'][5] = None

C:\Users\Saurabh\AppData\Local\Temp\ipykernel_30152\1007309083.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][2] = None
C:\Users\Saurabh\AppData\Local\Temp\ipykernel_30152\1007309083.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Department'][4] = None
C:\Users\Saurabh\AppData\Local\Temp\ipykernel_30152\1007309083.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][4] = None
C:\Users\Saurabh\AppData\Local\Temp\ipykernel_30152\1007309083.py:3: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Department'][5] = None
C:\Users\Saurabh\AppData\Local\Temp\ipykernel_30152\1007309083.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][5] = None

In [47]:
df

   Emp_ID     Name Department  Working_Hours
0       1      sam         IT              8
1       2    rajat      SALES             10
2       3     None         IT              9
3       4   yamini         HR              8
4       5  pallavi       None              9
5       6   garvit       None              8
6       7    suman      SALES              9
7       8  saurabh         IT              9

In [48]:
df.isnull().sum()

Emp_ID           0
Name             1
Department       2
Working_Hours    0
dtype: int64

In [51]:
df = df.dropna()

In [52]:
df.isnull().sum()

Emp_ID           0
Name             0
Department       0
Working_Hours    0
dtype: int64

In [53]:
df

   Emp_ID     Name Department  Working_Hours
0       1      sam         IT              8
1       2    rajat      SALES             10
3       4   yamini         HR              8
6       7    suman      SALES              9
7       8  saurabh         IT              9

In [54]:
# DataFrame 

# Student Information ===> 
# Student ID,
# Course Name,
# Course Duration , 
# Fees


# data import and export 
# head() , tail() , sample() , 
# create missing data , handle missing data ,
# value_counts()